CREATE TABLE energy_balance_35 (
    year INTEGER PRIMARY KEY,

    "Все электростанции млн кВт" NUMERIC,
    "Все электростанции млрд кВтч" NUMERIC,

    "Тепловые млн кВт" NUMERIC,
    "Тепловые млрд кВтч" NUMERIC,

    "Гидроэлектростанции млн кВт" NUMERIC,
    "Гидроэлектростанции млрд кВтч" NUMERIC,

    "Атомные млн кВт" NUMERIC,
    "Атомные млрд кВтч" NUMERIC,

    "Возобновл. источники млн кВт" NUMERIC,
    "Возобновл. источники млрд кВтч" NUMERIC,

    "Пар и горячая вода, млн Гкал" NUMERIC
);

INSERT INTO energy_balance_35 VALUES
(2017, 262, 1094, 182, 703, 51.2, 187, 28.0, 203, 0.7, 1.1, 1272),
(2018, 266, 1115, 184, 716, 51.3, 193, 29.1, 205, 0.9, 1.4, 1310),
(2019, 270, 1121, 186, 714, 51.8, 197, 30.3, 209, 1.7, 2.1, 1271),
(2020, 270, 1090, 186, 656, 52.3, 214, 29.4, 216, 2.9, 3.7, 1242),
(2021, 270, 1159, 184, 715, 52.4, 216, 29.6, 223, 3.5, 6.0, 1341),
(2022, 270, 1170, 184, 738, 52.5, 199, 29.6, 224, 3.9, 8.6, 1316),
(2023, 272, 1181, 185, 753, 52.8, 202, 29.6, 218, 4.1, 7.9, 1298),
(2024, 281, 1213, 195, 777, 52.8, 212, 28.6, 216, 4.2, 7.7, 1309);