CREATE TABLE polymer_products_22 (
    year INTEGER PRIMARY KEY,
    "Шины, покрышки и камеры, млн.шт" NUMERIC,
    "для автобусов, троллейбусов и грузовых" NUMERIC,
    "для легковых автомобилей" NUMERIC,
    "для сельскохоз машин" NUMERIC,
    "для мотоциклов или велосипедов" NUMERIC,
    "Трубы,трубки,шланги, тыс.т" NUMERIC,
    "Плиты,листы,пленка и полосы, тыс.т" NUMERIC,
    "Мат. для пола,стен,потолка млн.м2" NUMERIC
);

INSERT INTO polymer_products_22 (
    year,
    "Шины, покрышки и камеры, млн.шт",
    "для автобусов, троллейбусов и грузовых",
    "для легковых автомобилей",
    "для сельскохоз машин",
    "для мотоциклов или велосипедов",
    "Трубы,трубки,шланги, тыс.т",
    "Плиты,листы,пленка и полосы, тыс.т",
    "Мат. для пола,стен,потолка млн.м2"
) VALUES
(2017, 65.1, 7.8, 44.5, 1.9, 0.9, 590, 1056, 258),
(2018, 67.5, 7.8, 47.6, 1.7, 0.8, 619, 1222, 237),
(2019, 60.4, 6.5, 43.1, 1.5, 0.8, 635, 1222, 230),
(2020, 55.3, 6.8, 37.6, 1.7, 0.8, 671, 1393, 233),
(2021, 65.7, 7.4, 47.2, 2.0, 0.8, 906, 1501, 269),
(2022, 50.8, 6.3, 34.3, 1.4, 0.6, 1081, 1557, 301),
(2023, 45.6, 6.5, 30.3, 1.1, 0.7, 1118, 1732, 321),
(2024, 48.7, 5.9, 35.4, 1.0, 0.7, 1115, 1749, 312);