CREATE TABLE transport_other_30 (
    year INTEGER PRIMARY KEY,
    "Суда прогулочные тыс.шт" NUMERIC,
    "Электровозы магистральные,шт" NUMERIC,
    "Тепловозы магистральные, секций" NUMERIC,
    "Тепловозы маневровые, шт" NUMERIC,
    "Вагоны пассажирские, шт" NUMERIC,
    "Вагоны грузовые, тыс.шт" NUMERIC,
    "Вагоны-цистерны, тыс.шт" NUMERIC,
    "Вертолеты, шт" NUMERIC,
    "Вертолеты пассажирские, шт" NUMERIC,
    "Вертолеты грузовые, шт" NUMERIC,
    "Самолеты гражданские, шт" NUMERIC,
    "Мотоциклы, тыс.шт" NUMERIC,
    "Велосипеды, тыс.шт" NUMERIC
);

INSERT INTO transport_other_30 VALUES
(2017, 10.9, 225, 197, 197, 961, 58.1, 2.6, 70,  NULL, NULL, 21, 3.8, 1547),
(2018, 7.8,  354, 214, 242, 1409, 68.8, 2.9, 103, NULL, NULL, 28, 1.8, 1301),
(2019, 6.9,  397, 283, 315, 1632, 79.7, 3.6, 89,  NULL, NULL, 43, 1.6, 1491),
(2020, 4.9,  341, 233, 276, 1962, 57.1, 6.4, 96,  NULL, NULL, 27, 1.3, 1055),
(2021, 7.0,  290, 244, 276, 1561, 63.1, 5.8, 108, NULL, NULL, 42, 1.3, 1413),
(2022, 12.8, 321, 177, 277, 1444, 50.2, 5.3, 199, NULL, NULL, 43, 2.1, 1023),
(2023, 15.3, 314, 218, 292, 1682, 63.9, 8.6, NULL, 10, 156, 24, 0.2, 541),
(2024, 18.1, 338, 281, 291, 1649, 74.7, 12.8, NULL, 4, 153, 23, 0.7, 490);