CREATE TABLE electronics_production_26 (
    year INTEGER PRIMARY KEY,
    "Приборы полупроводниковые, млн.штук" NUMERIC,
    "Компьютеры, млрд.рублей" NUMERIC,
    "Радиоприемники, тыс.штук" NUMERIC,
    "Часы всех видов, тыс.штук" NUMERIC
);

INSERT INTO electronics_production_26 (
    year,
    "Приборы полупроводниковые, млн.штук",
    "Компьютеры, млрд.рублей",
    "Радиоприемники, тыс.штук",
    "Часы всех видов, тыс.штук"
) VALUES
(2017, 64.5, 36.0, 70.2, 2723),
(2018, 48.1, 37.0, 595, 1444),
(2019, 29.4, 35.2, 29.3, 660),
(2020, 25.5, 50.7, 15.1, 455),
(2021, 39.6, 47.0, 15.5, 554),
(2022, 42.3, 88.9, 8.8, 413),
(2023, 54.7, 154, 10.8, 452),
(2024, 43.1, 269, 23.8, 557);