CREATE TABLE transport_production_29 (
    year INTEGER PRIMARY KEY,
    "ДВС, тыс.штук" NUMERIC,
    "Автомобили легковые, тыс.штук" NUMERIC,
    "Автобусы тыс.штук" NUMERIC,
    "Автобусы (более 5т) тыс.штук" NUMERIC,
    "Автобусы (не более 5т) тыс.штук" NUMERIC,
    "Троллейбусы, штук" NUMERIC,
    "Грузовые ТС, тыс.штук" NUMERIC,
    "Автокраны, штук" NUMERIC,
    "Автомобили пожарные, штук" NUMERIC,
    "Коммунальные ТС штук" NUMERIC,
    "Прицепы и полуприцепы тыс.штук" NUMERIC,
    "Прицепы и полуприцепы тракторные" NUMERIC
);

INSERT INTO transport_production_29 VALUES
(2017, 307, 1356, 40.7, NULL, NULL, 250, 163, 2731, 936, 4074, 81.7, 6.9),
(2018, 359, 1565, 45.8, NULL, NULL, 181, 157, 2941, 1029, 5121, 88.7, 6.2),
(2019, 337, 1525, NULL, 14.3, 25.2, 188, 156, 2966, 1109, 6659, 125, 6.6),
(2020, 294, 1262, NULL, 13.6, 21.2, 318, 143, 2789, 991, 5072, 168, 7.1),
(2021, 341, 1365, NULL, 14.8, 22.0, 330, 186, 3427, 1132, 5623, 164, 6.8),
(2022, 227, 451,  NULL, 12.7, 13.7, 245, 141, 3296, 1527, 5557, 140, 7.0),
(2023, 201, 543,  NULL, 13.8, 23.2, 643, 180, 3369, 1495, 6046, 208, 6.4),
(2024, 226, 763,  NULL, 15.3, 19.9, 757, 194, 2413, 1369, 7479, 272, 7.6);