CREATE TABLE oil_products_19 (
    year INTEGER PRIMARY KEY,
    "Кокс и полукокс из каменного угля" NUMERIC,
    "Нефть, поступившая на переработку" NUMERIC,
    "Бензин автомобильный" NUMERIC,
    "Топливо дизельное" NUMERIC,
    "Мазут топочный" NUMERIC
);

INSERT INTO oil_products_19 (
    year,
    "Кокс и полукокс из каменного угля",
    "Нефть, поступившая на переработку",
    "Бензин автомобильный",
    "Топливо дизельное",
    "Мазут топочный"
) VALUES
(2017, 28.0, 284, 38.0, 76.8, 51.5),
(2018, 27.0, 292, 39.1, 77.5, 49.3),
(2019, 26.9, 290, 39.9, 78.4, 47.2),
(2020, 27.0, 275, 38.4, 77.8, 41.9),
(2021, 28.0, 285, 40.8, 80.4, 44.3),
(2022, 25.4, 277, 42.3, 84.7, 40.9),
(2023, 25.6, NULL, 44.0, 88.2, 41.8),
(2024, 24.1, NULL, NULL, NULL, NULL);